# Selected

## Description
Function Selected returns the selection status of the referenced object.&lt;BR&gt;

```pascal
FUNCTION Selected(h : HANDLE) : BOOLEAN;
```

```python

def vs.Selected(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from MiniCAD
## Category
* Selection